wroscoe/dustycam-archive/cameras/common/espidf/bench/ble_spike/sdkconfig.defaults
# Seeed XIAO ESP32S3 Sense: 8 MB flash (DIO), 8 MB octal PSRAM.
# Copied verbatim from cameras/xiao_pantilt/software/app/sdkconfig.defaults
# (same physical board) plus the docs/phone_app_plan.md §3 SRAM-diet block
# below (dusty_ble/sdkconfig.ble's content, inlined here per that file's own
# header comment: IDF merges -DSDKCONFIG_DEFAULTS lists, it does not
# #include fragments, so a project either names both files on the
# idf.py command line or inlines the fragment like this).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# FATFS long file names (spool sidecar/jpg names are short 8.3-safe today,
# but the standard's layout keeps this on generally)
CONFIG_FATFS_LFN_HEAP=y

# Custom OTA-capable partition table (partitions.csv), two 3 MB app slots
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xc000

# OTA: rollback safety net + plain-HTTP fallback for LAN dev; the XIAO's
# real deployment uses SERVER_TLS (Funnel), cert bundle on. The spike does
# not use dusty_ota, but keeps the same partition/app-update posture as
# the real xiao_pantilt app since it shares a partition table.
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_TLS_INSECURE=n

# OTA download from app_main overflows the 3.5 KB default stack (sarg:
# esp-https-ota-main-task-stack-overflow-reboot-loop-bricks-ota); kept even
# though this spike doesn't call esp_https_ota, for parity with the real app.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# The XIAO has no UART bridge; the console (and monitor.py) is
# USB-Serial-JTAG.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y

# Deep-sleep wake cycle: don't let the watchdog fire across a long serve
# loop, and keep tick resolution fine enough for the 2 ms notify pacing.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_FREERTOS_HZ=1000

# ============================================================
# docs/phone_app_plan.md §3 SRAM diet (dusty_ble/sdkconfig.ble, inlined)
# ============================================================

# ---- NimBLE peripheral only: no central/observer, no pairing (decision 5:
# HMAC challenge with an owner key instead of LE Secure Connections) ----
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=0
CONFIG_BT_NIMBLE_MAX_CCCDS=4
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=16
# 8 was measured (bench review finding) to run out well before a thumb/
# frame transfer drains it (BLE_HS_ENOMEM a few fragments in); these
# blocks live in PSRAM (MEM_ALLOC_MODE_EXTERNAL below). notify_sink() in
# dusty_ble.c also retries on ENOMEM regardless.
CONFIG_BT_NIMBLE_SECURITY_ENABLE=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=5120
# default 4096; on_cmd_write() (dusty_ble.c) reassembles a ~518 B frame on
# this task's stack.
CONFIG_BT_CTRL_BLE_MAX_ACT=2
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=n
# Explicit, not just "unset" (bench review finding): with both BT and
# Wi-Fi enabled, IDF 5.5 defaults this to y, contrary to decision 9
# ("sequential radios", never concurrent). Leaving it unset silently keeps
# coexistence code enabled -- confirmed off with:
#   grep COEX_SW build/config/sdkconfig.h

# ---- Wi-Fi buffer trims (re-measured at XIAO gate 4, P1.4) ----
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ---- TLS: dynamic buffers on; SSL_IN_CONTENT_LEN stays at the IDF
# default (16384) until P1 verifies the Funnel endpoint honours a smaller
# max_fragment_length -- deliberately NOT overridden here. ----
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
# (CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT depends on the above and already
# defaults to y; there is no CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT symbol
# in IDF 5.5 -- bench review finding, that line was a silently-ignored typo.)

# ---- stacks / heap ----
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
# Bench review finding: CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY does not
# exist on IDF 5.5 -- it was renamed to the symbol above. dusty_ble.c's own
# #if checks the new name first and falls back to the old one.
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
